      * Region,Country,Units Sold,Unit Price,Total Revenue
       01 csv-rec.
           05  Region              PIC X(48).
           05  Country             PIC X(48).
           05  UnitsSold           PIC 9(9).
           05  UnitPrice           PIC 9(9)V99.
           05  TotalRevenue        PIC 9(9)V99.
