//ECBLUNIT JOB 1,NOTIFY=&SYSUID
//*COMPILE MODULES
//COMPILE      EXEC IGYWCL,PARM='NAME(NOALIAS)'
//COBOL.SYSLIB DD DSN=&SYSUID..CPY(SALES),DISP=SHR
//COBOL.SYSIN  DD DSN=&SYSUID..CBL(MODULES),DISP=SHR
//LKED.SYSLMOD DD DSN=&SYSUID..LOAD(MODULES),DISP=SHR
//LKED.SYSLIB  DD DSN=CEE.SCEELKED,DISP=SHR
//             DD DSN=CEE.SCEELKEX,DISP=SHR
//             DD DSN=&SYSUID..LOAD,DISP=SHR
//*COMPILE TESTS
//COMPILE      EXEC IGYWCL,PARM='NAME(NOALIAS)'
//COBOL.SYSLIB DD DSN=&SYSUID..CPY(SALES),DISP=SHR
//COBOL.SYSIN  DD DSN=&SYSUID..CBL(TESTS),DISP=SHR
//LKED.SYSLMOD DD DSN=&SYSUID..LOAD(TESTS),DISP=SHR
//LKED.SYSLIB  DD DSN=CEE.SCEELKED,DISP=SHR
//             DD DSN=CEE.SCEELKEX,DISP=SHR
//             DD DSN=&SYSUID..LOAD,DISP=SHR
//LKED.SYSIN   DD *
  INCLUDE SYSLIB(ECBLUNIT)
  ENTRY ECBLUNIT MAIN ENTRY POINT
// IF RC = 0 THEN
//*RUN ECBLUNIT
//RUN          EXEC PGM=ECBLUNIT,PARM='TESTALL'
//STEPLIB      DD DSN=&SYSUID..LOAD,DISP=SHR
//PRTLINE      DD SYSOUT=*,OUTLIM=15000
//SYSOUT       DD SYSOUT=*,OUTLIM=15000
//CEEDUMP      DD DUMMY
//SYSUDUMP     DD DUMMY
// ELSE
// ENDIF